MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS505/mcu.h
/* RPINR22 */
#define _SDI2R RPINR22bits.SDI2R
#define _SCK2INR RPINR22bits.SCK2INR
#define _SDI2R0 RPINR22bits.SDI2R0
#define _SDI2R1 RPINR22bits.SDI2R1
#define _SDI2R2 RPINR22bits.SDI2R2
#define _SDI2R3 RPINR22bits.SDI2R3
#define _SDI2R4 RPINR22bits.SDI2R4
#define _SDI2R5 RPINR22bits.SDI2R5
#define _SDI2R6 RPINR22bits.SDI2R6
#define _SDI2R7 RPINR22bits.SDI2R7
#define _SCK2INR0 RPINR22bits.SCK2INR0
#define _SCK2INR1 RPINR22bits.SCK2INR1
#define _SCK2INR2 RPINR22bits.SCK2INR2
#define _SCK2INR3 RPINR22bits.SCK2INR3
#define _SCK2INR4 RPINR22bits.SCK2INR4
#define _SCK2INR5 RPINR22bits.SCK2INR5
#define _SCK2INR6 RPINR22bits.SCK2INR6
#define _SCK2INR7 RPINR22bits.SCK2INR7

/* RPINR23 */
#define _SS2R RPINR23bits.SS2R
#define _SS2R0 RPINR23bits.SS2R0
#define _SS2R1 RPINR23bits.SS2R1
#define _SS2R2 RPINR23bits.SS2R2
#define _SS2R3 RPINR23bits.SS2R3
#define _SS2R4 RPINR23bits.SS2R4
#define _SS2R5 RPINR23bits.SS2R5
#define _SS2R6 RPINR23bits.SS2R6
#define _SS2R7 RPINR23bits.SS2R7

/* RPINR37 */
#define _SYNCI1R RPINR37bits.SYNCI1R
#define _SYNCI1R0 RPINR37bits.SYNCI1R0
#define _SYNCI1R1 RPINR37bits.SYNCI1R1
#define _SYNCI1R2 RPINR37bits.SYNCI1R2
#define _SYNCI1R3 RPINR37bits.SYNCI1R3
#define _SYNCI1R4 RPINR37bits.SYNCI1R4
#define _SYNCI1R5 RPINR37bits.SYNCI1R5
#define _SYNCI1R6 RPINR37bits.SYNCI1R6
#define _SYNCI1R7 RPINR37bits.SYNCI1R7
#define _SYCI1R RPINR37bits.SYCI1R
#define _SYCI1R0 RPINR37bits.SYCI1R0
#define _SYCI1R1 RPINR37bits.SYCI1R1
#define _SYCI1R2 RPINR37bits.SYCI1R2
#define _SYCI1R3 RPINR37bits.SYCI1R3
#define _SYCI1R4 RPINR37bits.SYCI1R4
#define _SYCI1R5 RPINR37bits.SYCI1R5
#define _SYCI1R6 RPINR37bits.SYCI1R6
#define _SYCI1R7 RPINR37bits.SYCI1R7

/* RPINR38 */
#define _SYNCI2R RPINR38bits.SYNCI2R
#define _SYNCI2R0 RPINR38bits.SYNCI2R0
#define _SYNCI2R1 RPINR38bits.SYNCI2R1
#define _SYNCI2R2 RPINR38bits.SYNCI2R2
#define _SYNCI2R3 RPINR38bits.SYNCI2R3
#define _SYNCI2R4 RPINR38bits.SYNCI2R4
#define _SYNCI2R5 RPINR38bits.SYNCI2R5
#define _SYNCI2R6 RPINR38bits.SYNCI2R6
#define _SYNCI2R7 RPINR38bits.SYNCI2R7
#define _SYCI2R RPINR38bits.SYCI2R
#define _SYCI2R0 RPINR38bits.SYCI2R0
#define _SYCI2R1 RPINR38bits.SYCI2R1
#define _SYCI2R2 RPINR38bits.SYCI2R2
#define _SYCI2R3 RPINR38bits.SYCI2R3
#define _SYCI2R4 RPINR38bits.SYCI2R4
#define _SYCI2R5 RPINR38bits.SYCI2R5
#define _SYCI2R6 RPINR38bits.SYCI2R6
#define _SYCI2R7 RPINR38bits.SYCI2R7

/* RPINR42 */
#define _FLT5R RPINR42bits.FLT5R
#define _FLT6R RPINR42bits.FLT6R
#define _FLT5R0 RPINR42bits.FLT5R0
#define _FLT5R1 RPINR42bits.FLT5R1
#define _FLT5R2 RPINR42bits.FLT5R2
#define _FLT5R3 RPINR42bits.FLT5R3
#define _FLT5R4 RPINR42bits.FLT5R4
#define _FLT5R5 RPINR42bits.FLT5R5
#define _FLT5R6 RPINR42bits.FLT5R6
#define _FLT5R7 RPINR42bits.FLT5R7
#define _FLT6R0 RPINR42bits.FLT6R0
#define _FLT6R1 RPINR42bits.FLT6R1
#define _FLT6R2 RPINR42bits.FLT6R2
#define _FLT6R3 RPINR42bits.FLT6R3
#define _FLT6R4 RPINR42bits.FLT6R4
#define _FLT6R5 RPINR42bits.FLT6R5
#define _FLT6R6 RPINR42bits.FLT6R6
#define _FLT6R7 RPINR42bits.FLT6R7

/* RPINR43 */
#define _FLT7R RPINR43bits.FLT7R
#define _FLT8R RPINR43bits.FLT8R
#define _FLT7R0 RPINR43bits.FLT7R0
#define _FLT7R1 RPINR43bits.FLT7R1
#define _FLT7R2 RPINR43bits.FLT7R2
#define _FLT7R3 RPINR43bits.FLT7R3
#define _FLT7R4 RPINR43bits.FLT7R4
#define _FLT7R5 RPINR43bits.FLT7R5
#define _FLT7R6 RPINR43bits.FLT7R6
#define _FLT7R7 RPINR43bits.FLT7R7
#define _FLT8R0 RPINR43bits.FLT8R0
#define _FLT8R1 RPINR43bits.FLT8R1
#define _FLT8R2 RPINR43bits.FLT8R2
#define _FLT8R3 RPINR43bits.FLT8R3
#define _FLT8R4 RPINR43bits.FLT8R4
#define _FLT8R5 RPINR43bits.FLT8R5
#define _FLT8R6 RPINR43bits.FLT8R6
#define _FLT8R7 RPINR43bits.FLT8R7

/* NVMCON */
#define _NVMOP NVMCONbits.NVMOP
#define _URERR NVMCONbits.URERR
#define _RPDF NVMCONbits.RPDF
#define _P2ACTIV NVMCONbits.P2ACTIV
#define _SFTSWP NVMCONbits.SFTSWP
#define _NVMSIDL NVMCONbits.NVMSIDL
#define _WRERR NVMCONbits.WRERR
#define _WREN NVMCONbits.WREN
#define _WR NVMCONbits.WR
#define _NVMOP0 NVMCONbits.NVMOP0
#define _NVMOP1 NVMCONbits.NVMOP1
#define _NVMOP2 NVMCONbits.NVMOP2
#define _NVMOP3 NVMCONbits.NVMOP3

/* NVMADR */
#define _NVMADRL NVMADRbits.NVMADRL
#define _NVMADR NVMADRbits.NVMADR

/* NVMADRH */
#define _NVMADRH NVMADRHbits.NVMADRH
#define _NVMADRU NVMADRHbits.NVMADRU

/* NVMSRCADDR */
#define _NVMSRCADRL NVMSRCADDRbits.NVMSRCADRL

/* NVMSRCADRH */
#define _NVMSRCADRH NVMSRCADRHbits.NVMSRCADRH

/* RCON */
#define _POR RCONbits.POR
#define _BOR RCONbits.BOR
#define _IDLE RCONbits.IDLE
#define _SLEEP RCONbits.SLEEP
#define _WDTO RCONbits.WDTO
#define _SWDTEN RCONbits.SWDTEN
#define _SWR RCONbits.SWR
#define _EXTR RCONbits.EXTR
#define _VREGS RCONbits.VREGS
#define _CM RCONbits.CM
#define _VREGSF RCONbits.VREGSF
#define _IOPUWR RCONbits.IOPUWR
#define _TRAPR RCONbits.TRAPR

/* OSCCON */
#define _OSWEN OSCCONbits.OSWEN
#define _CF OSCCONbits.CF
#define _LOCK OSCCONbits.LOCK
#define _IOLOCK OSCCONbits.IOLOCK
#define _CLKLOCK OSCCONbits.CLKLOCK
#define _NOSC OSCCONbits.NOSC
#define _COSC OSCCONbits.COSC
#define _NOSC0 OSCCONbits.NOSC0
#define _NOSC1 OSCCONbits.NOSC1
#define _NOSC2 OSCCONbits.NOSC2
#define _COSC0 OSCCONbits.COSC0
#define _COSC1 OSCCONbits.COSC1
#define _COSC2 OSCCONbits.COSC2

/* CLKDIV */
#define _PLLPRE CLKDIVbits.PLLPRE
#define _PLLPOST CLKDIVbits.PLLPOST
#define _FRCDIV CLKDIVbits.FRCDIV
#define _DOZEN CLKDIVbits.DOZEN
#define _DOZE CLKDIVbits.DOZE
#define _ROI CLKDIVbits.ROI
#define _PLLPRE0 CLKDIVbits.PLLPRE0
#define _PLLPRE1 CLKDIVbits.PLLPRE1
#define _PLLPRE2 CLKDIVbits.PLLPRE2
#define _PLLPRE3 CLKDIVbits.PLLPRE3
#define _PLLPRE4 CLKDIVbits.PLLPRE4
#define _PLLPOST0 CLKDIVbits.PLLPOST0
#define _PLLPOST1 CLKDIVbits.PLLPOST1
#define _FRCDIV0 CLKDIVbits.FRCDIV0
#define _FRCDIV1 CLKDIVbits.FRCDIV1
#define _FRCDIV2 CLKDIVbits.FRCDIV2
#define _DOZE0 CLKDIVbits.DOZE0
#define _DOZE1 CLKDIVbits.DOZE1
#define _DOZE2 CLKDIVbits.DOZE2

/* PLLFBD */
#define _PLLDIV PLLFBDbits.PLLDIV
#define _PLLDIV0 PLLFBDbits.PLLDIV0
#define _PLLDIV1 PLLFBDbits.PLLDIV1
#define _PLLDIV2 PLLFBDbits.PLLDIV2
#define _PLLDIV3 PLLFBDbits.PLLDIV3
#define _PLLDIV4 PLLFBDbits.PLLDIV4
#define _PLLDIV5 PLLFBDbits.PLLDIV5
#define _PLLDIV6 PLLFBDbits.PLLDIV6
#define _PLLDIV7 PLLFBDbits.PLLDIV7
#define _PLLDIV8 PLLFBDbits.PLLDIV8

/* OSCTUN */
#define _TUN OSCTUNbits.TUN
#define _TUN0 OSCTUNbits.TUN0
#define _TUN1 OSCTUNbits.TUN1
#define _TUN2 OSCTUNbits.TUN2
#define _TUN3 OSCTUNbits.TUN3
#define _TUN4 OSCTUNbits.TUN4
#define _TUN5 OSCTUNbits.TUN5

/* LFSR */
#define _LFSR LFSRbits.LFSR

/* REFOCON */
#define _RODIV REFOCONbits.RODIV
#define _ROSEL REFOCONbits.ROSEL
#define _ROSSLP REFOCONbits.ROSSLP
#define _ROON REFOCONbits.ROON
#define _RODIV0 REFOCONbits.RODIV0
#define _RODIV1 REFOCONbits.RODIV1
#define _RODIV2 REFOCONbits.RODIV2
#define _RODIV3 REFOCONbits.RODIV3

