MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS505/mcu.h
#define _ADCON4L_SAMC0EN_POSITION                0x00000000
#define _ADCON4L_SAMC0EN_MASK                    0x00000001
#define _ADCON4L_SAMC0EN_LENGTH                  0x00000001

#define _ADCON4L_SAMC1EN_POSITION                0x00000001
#define _ADCON4L_SAMC1EN_MASK                    0x00000002
#define _ADCON4L_SAMC1EN_LENGTH                  0x00000001

#define _ADCON4L_SAMC2EN_POSITION                0x00000002
#define _ADCON4L_SAMC2EN_MASK                    0x00000004
#define _ADCON4L_SAMC2EN_LENGTH                  0x00000001

#define _ADCON4L_SAMC3EN_POSITION                0x00000003
#define _ADCON4L_SAMC3EN_MASK                    0x00000008
#define _ADCON4L_SAMC3EN_LENGTH                  0x00000001

#define _ADCON4L_SYNCTRG0_POSITION               0x00000008
#define _ADCON4L_SYNCTRG0_MASK                   0x00000100
#define _ADCON4L_SYNCTRG0_LENGTH                 0x00000001

#define _ADCON4L_SYNCTRG1_POSITION               0x00000009
#define _ADCON4L_SYNCTRG1_MASK                   0x00000200
#define _ADCON4L_SYNCTRG1_LENGTH                 0x00000001

#define _ADCON4L_SYNCTRG2_POSITION               0x0000000A
#define _ADCON4L_SYNCTRG2_MASK                   0x00000400
#define _ADCON4L_SYNCTRG2_LENGTH                 0x00000001

#define _ADCON4L_SYNCTRG3_POSITION               0x0000000B
#define _ADCON4L_SYNCTRG3_MASK                   0x00000800
#define _ADCON4L_SYNCTRG3_LENGTH                 0x00000001

#define _ADCON4H_C0CHS_POSITION                  0x00000000
#define _ADCON4H_C0CHS_MASK                      0x00000003
#define _ADCON4H_C0CHS_LENGTH                    0x00000002

#define _ADCON4H_C1CHS_POSITION                  0x00000002
#define _ADCON4H_C1CHS_MASK                      0x0000000C
#define _ADCON4H_C1CHS_LENGTH                    0x00000002

#define _ADCON4H_C2CHS_POSITION                  0x00000004
#define _ADCON4H_C2CHS_MASK                      0x00000030
#define _ADCON4H_C2CHS_LENGTH                    0x00000002

#define _ADCON4H_C3CHS_POSITION                  0x00000006
#define _ADCON4H_C3CHS_MASK                      0x000000C0
#define _ADCON4H_C3CHS_LENGTH                    0x00000002

#define _ADCON4H_C0CHS0_POSITION                 0x00000000
#define _ADCON4H_C0CHS0_MASK                     0x00000001
#define _ADCON4H_C0CHS0_LENGTH                   0x00000001

#define _ADCON4H_C0CHS1_POSITION                 0x00000001
#define _ADCON4H_C0CHS1_MASK                     0x00000002
#define _ADCON4H_C0CHS1_LENGTH                   0x00000001

#define _ADCON4H_C1CHS0_POSITION                 0x00000002
#define _ADCON4H_C1CHS0_MASK                     0x00000004
#define _ADCON4H_C1CHS0_LENGTH                   0x00000001

#define _ADCON4H_C1CHS1_POSITION                 0x00000003
#define _ADCON4H_C1CHS1_MASK                     0x00000008
#define _ADCON4H_C1CHS1_LENGTH                   0x00000001

#define _ADCON4H_C2CHS0_POSITION                 0x00000004
#define _ADCON4H_C2CHS0_MASK                     0x00000010
#define _ADCON4H_C2CHS0_LENGTH                   0x00000001

#define _ADCON4H_C2CHS1_POSITION                 0x00000005
#define _ADCON4H_C2CHS1_MASK                     0x00000020
#define _ADCON4H_C2CHS1_LENGTH                   0x00000001

#define _ADCON4H_C3CHS0_POSITION                 0x00000006
#define _ADCON4H_C3CHS0_MASK                     0x00000040
#define _ADCON4H_C3CHS0_LENGTH                   0x00000001

#define _ADCON4H_C3CHS1_POSITION                 0x00000007
#define _ADCON4H_C3CHS1_MASK                     0x00000080
#define _ADCON4H_C3CHS1_LENGTH                   0x00000001

#define _ADMOD0L_SIGN0_POSITION                  0x00000000
#define _ADMOD0L_SIGN0_MASK                      0x00000001
#define _ADMOD0L_SIGN0_LENGTH                    0x00000001

#define _ADMOD0L_DIFF0_POSITION                  0x00000001
#define _ADMOD0L_DIFF0_MASK                      0x00000002
#define _ADMOD0L_DIFF0_LENGTH                    0x00000001

#define _ADMOD0L_SIGN1_POSITION                  0x00000002
#define _ADMOD0L_SIGN1_MASK                      0x00000004
#define _ADMOD0L_SIGN1_LENGTH                    0x00000001

#define _ADMOD0L_DIFF1_POSITION                  0x00000003
#define _ADMOD0L_DIFF1_MASK                      0x00000008
#define _ADMOD0L_DIFF1_LENGTH                    0x00000001

#define _ADMOD0L_SIGN2_POSITION                  0x00000004
#define _ADMOD0L_SIGN2_MASK                      0x00000010
#define _ADMOD0L_SIGN2_LENGTH                    0x00000001

#define _ADMOD0L_DIFF2_POSITION                  0x00000005
#define _ADMOD0L_DIFF2_MASK                      0x00000020
#define _ADMOD0L_DIFF2_LENGTH                    0x00000001

#define _ADMOD0L_SIGN3_POSITION                  0x00000006
#define _ADMOD0L_SIGN3_MASK                      0x00000040
#define _ADMOD0L_SIGN3_LENGTH                    0x00000001

#define _ADMOD0L_DIFF3_POSITION                  0x00000007
#define _ADMOD0L_DIFF3_MASK                      0x00000080
#define _ADMOD0L_DIFF3_LENGTH                    0x00000001

#define _ADMOD0L_SIGN4_POSITION                  0x00000008
#define _ADMOD0L_SIGN4_MASK                      0x00000100
#define _ADMOD0L_SIGN4_LENGTH                    0x00000001

#define _ADMOD0L_DIFF4_POSITION                  0x00000009
#define _ADMOD0L_DIFF4_MASK                      0x00000200
#define _ADMOD0L_DIFF4_LENGTH                    0x00000001

#define _ADMOD0L_SIGN5_POSITION                  0x0000000A
#define _ADMOD0L_SIGN5_MASK                      0x00000400
#define _ADMOD0L_SIGN5_LENGTH                    0x00000001

#define _ADMOD0L_DIFF5_POSITION                  0x0000000B
#define _ADMOD0L_DIFF5_MASK                      0x00000800
#define _ADMOD0L_DIFF5_LENGTH                    0x00000001

#define _ADMOD0L_SIGN6_POSITION                  0x0000000C
#define _ADMOD0L_SIGN6_MASK                      0x00001000
#define _ADMOD0L_SIGN6_LENGTH                    0x00000001

#define _ADMOD0L_DIFF6_POSITION                  0x0000000D
#define _ADMOD0L_DIFF6_MASK                      0x00002000
#define _ADMOD0L_DIFF6_LENGTH                    0x00000001

#define _ADMOD0L_SIGN7_POSITION                  0x0000000E
#define _ADMOD0L_SIGN7_MASK                      0x00004000
#define _ADMOD0L_SIGN7_LENGTH                    0x00000001

#define _ADMOD0L_DIFF7_POSITION                  0x0000000F
#define _ADMOD0L_DIFF7_MASK                      0x00008000
#define _ADMOD0L_DIFF7_LENGTH                    0x00000001

