MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS505/mcu.h
#define _CMP4CON_DACOE_POSITION                  0x00000008
#define _CMP4CON_DACOE_MASK                      0x00000100
#define _CMP4CON_DACOE_LENGTH                    0x00000001

#define _CMP4CON_FCLKSEL_POSITION                0x00000009
#define _CMP4CON_FCLKSEL_MASK                    0x00000200
#define _CMP4CON_FCLKSEL_LENGTH                  0x00000001

#define _CMP4CON_FLTREN_POSITION                 0x0000000A
#define _CMP4CON_FLTREN_MASK                     0x00000400
#define _CMP4CON_FLTREN_LENGTH                   0x00000001

#define _CMP4CON_HYSSEL_POSITION                 0x0000000B
#define _CMP4CON_HYSSEL_MASK                     0x00001800
#define _CMP4CON_HYSSEL_LENGTH                   0x00000002

#define _CMP4CON_CMPSIDL_POSITION                0x0000000D
#define _CMP4CON_CMPSIDL_MASK                    0x00002000
#define _CMP4CON_CMPSIDL_LENGTH                  0x00000001

#define _CMP4CON_CMPON_POSITION                  0x0000000F
#define _CMP4CON_CMPON_MASK                      0x00008000
#define _CMP4CON_CMPON_LENGTH                    0x00000001

#define _CMP4CON_INSEL0_POSITION                 0x00000006
#define _CMP4CON_INSEL0_MASK                     0x00000040
#define _CMP4CON_INSEL0_LENGTH                   0x00000001

#define _CMP4CON_INSEL1_POSITION                 0x00000007
#define _CMP4CON_INSEL1_MASK                     0x00000080
#define _CMP4CON_INSEL1_LENGTH                   0x00000001

#define _CMP4CON_HYSSEL0_POSITION                0x0000000B
#define _CMP4CON_HYSSEL0_MASK                    0x00000800
#define _CMP4CON_HYSSEL0_LENGTH                  0x00000001

#define _CMP4CON_HYSSEL1_POSITION                0x0000000C
#define _CMP4CON_HYSSEL1_MASK                    0x00001000
#define _CMP4CON_HYSSEL1_LENGTH                  0x00000001

#define _CMP4DAC_CMREF_POSITION                  0x00000000
#define _CMP4DAC_CMREF_MASK                      0x00000FFF
#define _CMP4DAC_CMREF_LENGTH                    0x0000000C

#define _CMP4DAC_CMREF0_POSITION                 0x00000000
#define _CMP4DAC_CMREF0_MASK                     0x00000001
#define _CMP4DAC_CMREF0_LENGTH                   0x00000001

#define _CMP4DAC_CMREF1_POSITION                 0x00000001
#define _CMP4DAC_CMREF1_MASK                     0x00000002
#define _CMP4DAC_CMREF1_LENGTH                   0x00000001

#define _CMP4DAC_CMREF2_POSITION                 0x00000002
#define _CMP4DAC_CMREF2_MASK                     0x00000004
#define _CMP4DAC_CMREF2_LENGTH                   0x00000001

#define _CMP4DAC_CMREF3_POSITION                 0x00000003
#define _CMP4DAC_CMREF3_MASK                     0x00000008
#define _CMP4DAC_CMREF3_LENGTH                   0x00000001

#define _CMP4DAC_CMREF4_POSITION                 0x00000004
#define _CMP4DAC_CMREF4_MASK                     0x00000010
#define _CMP4DAC_CMREF4_LENGTH                   0x00000001

#define _CMP4DAC_CMREF5_POSITION                 0x00000005
#define _CMP4DAC_CMREF5_MASK                     0x00000020
#define _CMP4DAC_CMREF5_LENGTH                   0x00000001

#define _CMP4DAC_CMREF6_POSITION                 0x00000006
#define _CMP4DAC_CMREF6_MASK                     0x00000040
#define _CMP4DAC_CMREF6_LENGTH                   0x00000001

#define _CMP4DAC_CMREF7_POSITION                 0x00000007
#define _CMP4DAC_CMREF7_MASK                     0x00000080
#define _CMP4DAC_CMREF7_LENGTH                   0x00000001

#define _CMP4DAC_CMREF8_POSITION                 0x00000008
#define _CMP4DAC_CMREF8_MASK                     0x00000100
#define _CMP4DAC_CMREF8_LENGTH                   0x00000001

#define _CMP4DAC_CMREF9_POSITION                 0x00000009
#define _CMP4DAC_CMREF9_MASK                     0x00000200
#define _CMP4DAC_CMREF9_LENGTH                   0x00000001

#define _CMP4DAC_CMREF10_POSITION                0x0000000A
#define _CMP4DAC_CMREF10_MASK                    0x00000400
#define _CMP4DAC_CMREF10_LENGTH                  0x00000001

#define _CMP4DAC_CMREF11_POSITION                0x0000000B
#define _CMP4DAC_CMREF11_MASK                    0x00000800
#define _CMP4DAC_CMREF11_LENGTH                  0x00000001

#define _RPOR0_RP32R_POSITION                    0x00000000
#define _RPOR0_RP32R_MASK                        0x0000003F
#define _RPOR0_RP32R_LENGTH                      0x00000006

#define _RPOR0_RP33R_POSITION                    0x00000008
#define _RPOR0_RP33R_MASK                        0x00003F00
#define _RPOR0_RP33R_LENGTH                      0x00000006

#define _RPOR0_RP32R0_POSITION                   0x00000000
#define _RPOR0_RP32R0_MASK                       0x00000001
#define _RPOR0_RP32R0_LENGTH                     0x00000001

#define _RPOR0_RP32R1_POSITION                   0x00000001
#define _RPOR0_RP32R1_MASK                       0x00000002
#define _RPOR0_RP32R1_LENGTH                     0x00000001

#define _RPOR0_RP32R2_POSITION                   0x00000002
#define _RPOR0_RP32R2_MASK                       0x00000004
#define _RPOR0_RP32R2_LENGTH                     0x00000001

#define _RPOR0_RP32R3_POSITION                   0x00000003
#define _RPOR0_RP32R3_MASK                       0x00000008
#define _RPOR0_RP32R3_LENGTH                     0x00000001

#define _RPOR0_RP32R4_POSITION                   0x00000004
#define _RPOR0_RP32R4_MASK                       0x00000010
#define _RPOR0_RP32R4_LENGTH                     0x00000001

#define _RPOR0_RP32R5_POSITION                   0x00000005
#define _RPOR0_RP32R5_MASK                       0x00000020
#define _RPOR0_RP32R5_LENGTH                     0x00000001

#define _RPOR0_RP33R0_POSITION                   0x00000008
#define _RPOR0_RP33R0_MASK                       0x00000100
#define _RPOR0_RP33R0_LENGTH                     0x00000001

#define _RPOR0_RP33R1_POSITION                   0x00000009
#define _RPOR0_RP33R1_MASK                       0x00000200
#define _RPOR0_RP33R1_LENGTH                     0x00000001

#define _RPOR0_RP33R2_POSITION                   0x0000000A
#define _RPOR0_RP33R2_MASK                       0x00000400
#define _RPOR0_RP33R2_LENGTH                     0x00000001

